MCP_Сервер_Выгрузка/DataProcessors/mcp_ТестированиеКода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>mcp_ТестированиеКода</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

MCP_Сервер_Выгрузка/InformationRegisters/mcp_ОчередьПроверкиКода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>mcp_ОчередьПроверкиКода</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.mcp_СтатусыПроверкиКода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>context</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>entry_point</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеИмяВременногоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

MCP_Сервер_Выгрузка/Enums/mcp_СтатусыПроверкиКода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>mcp_СтатусыПроверкиКода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

MCP_Сервер_Выгрузка/DataProcessors/mcp_ТестированиеКода/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура добавляет описание инструмента в таблицу инструментов MCP.
//
// Параметры:
//  Инструменты - ТаблицаЗначений - таблица с описанием инструментов.
//
Процедура ДобавитьИнструменты(Инструменты) Экспорт
	
	ДобавитьИнструмент_ВыполнитьПростойСценарий(Инструменты);
	ДобавитьИнструмент_ВыполнитьСложныйСценарий(Инструменты);
	
КонецПроцедуры

// Функция выполняет инструмент по его имени.
//
// Параметры:
//  ИмяИнструмента - Строка - имя вызываемого инструмента.
//  Аргументы - Структура - параметры инструмента.
//	Отладка - Булево - Убирает недоступные при обычном вызове методы и фоновые задания (по умолчанию Ложь)
//
// Возвращаемое значение:
//  Произвольный - результат выполнения инструмента.
//
Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы, Отладка = Ложь) Экспорт
		
	// 2. Маршрутизация вызова инструмента
	Если ИмяИнструмента = "execute_1c_code_simple" Тогда
		
		СтруктураПараметров = Новый Структура;
		
		// 1. Парсинг контекста (общий для всех инструментов)
		Попытка
			Если Аргументы.Свойство("context") И Не ПустаяСтрока(Аргументы.context) Тогда
				СтруктураПараметров = mcp_ОбщегоНазначения.JSONВСтруктуру(Аргументы.context);
			КонецЕсли;
		Исключение
			ВызватьИсключение "Ошибка разбора JSON в параметре context: " + ОписаниеОшибки();
		КонецПопытки;
		
		НачатьТранзакцию();
		Попытка
			Результат = ВыполнитьПростойСценарий(Аргументы.code, СтруктураПараметров);
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		Исключение
			ОтменитьТранзакцию();
			Возврат ОписаниеОшибки();
		КонецПопытки;
		
	ИначеЕсли ИмяИнструмента = "execute_1c_code_complex" Тогда
		
		Возврат ВыполнитьСложныйСценарий(Аргументы, Отладка);
		
	Иначе
		
		ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет в таблицу описание инструмента execute_1c_code_simple.
//
// Параметры:
//  Инструменты - ТаблицаЗначений - таблица с описанием инструментов.
//
Процедура ДобавитьИнструмент_ВыполнитьПростойСценарий(Инструменты)
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента("code",
		"string",
		"Код на встроенном языке 1С для выполнения.",
		,
		Истина));
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента("context",
		"string",
		"JSON-строка с переменными контекста, которые будут объявлены перед выполнением кода.",
		"{}",
		Ложь));
	
	СхемаПараметров = mcp_Метаданные.СхемаПараметровИнструмента(МассивПараметров);
	
	ОписаниеИнструмента = "Выполняет простой, самодостаточный фрагмент кода 1С."
		+ " Передавать только исполняемый код."
		+ " Если в коде есть оператор 'Возврат', результат будет возвращен.";
	
	mcp_Метаданные.ДобавитьИнструмент(Инструменты,
		"execute_1c_code_simple",
		ОписаниеИнструмента,
		СхемаПараметров);
	
КонецПроцедуры

// Процедура добавляет в таблицу описание инструмента execute_1c_code_complex.
//
// Параметры:
//  Инструменты - ТаблицаЗначений - таблица с описанием инструментов.
//
Процедура ДобавитьИнструмент_ВыполнитьСложныйСценарий(Инструменты)
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента("code",
		"string",
		"Код на встроенном языке 1С для выполнения, содержащий несколько процедур и/или функций.",
		,
		Истина));
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента("entry_point",
		"string",
		"Имя экспортной, серверной процедуры/функции для вызова. Параметр является обязательным.",
		"",
		Истина));
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента("context",
		"string",
		"JSON-строка с переменными контекста и параметры entry_point метода",
		"{}",
		Ложь));
	
	СхемаПараметров = mcp_Метаданные.СхемаПараметровИнструмента(МассивПараметров);
	
	ОписаниеИнструмента = "Выполняет сложные сценарии с несколькими процедурами и/или функциями 1С."
		+ Символы.ПС + "ВАЖНО: Всегда отдавайте предпочтение 'execute_1c_code_simple'."
		+ " Используйте этот инструмент, только если задача не может быть решена несколькими вызовами простого инструмента.";
	
	mcp_Метаданные.ДобавитьИнструмент(Инструменты,
		"execute_1c_code_complex",
		ОписаниеИнструмента,
		СхемаПараметров);
	
КонецПроцедуры

// Реализует сложный сценарий с асинхронной сборкой внешней обработки.
//
// Параметры:
//  Аргументы - Структура - параметры инструмента.
//
// Возвращаемое значение:
//  Строка - результат выполнения.
//
Функция ВыполнитьСложныйСценарий(Аргументы, Отладка)
	
	// Предварительная проверка обязательных аргументов
	Если Не Аргументы.Свойство("entry_point") ИЛИ ПустаяСтрока(Аргументы.entry_point) Тогда
		ВызватьИсключение "Параметр 'entry_point' является обязательным и не может быть пустым.";
	КонецЕсли;
	
	Если Не Аргументы.Свойство("code") ИЛИ ПустаяСтрока(Аргументы.code) Тогда
		ВызватьИсключение "Параметр 'code' является обязательным и не может быть пустым.";
	КонецЕсли;
	КодДляСборки = Аргументы.code;
	
	// 2. Создание и постановка задачи в очередь
	ИдентификаторЗадачи = Новый УникальныйИдентификатор();
	ТекущаяДата = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.mcp_ОчередьПроверкиКода.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.УникальныйИдентификатор = ИдентификаторЗадачи;
	НоваяЗапись.ДатаОбращения = ТекущаяДата; 
	НоваяЗапись.code = КодДляСборки;
	НоваяЗапись.entry_point = Аргументы.entry_point;
	Если Аргументы.Свойство("context") Тогда 
		НоваяЗапись.context = Аргументы.context;
	КонецЕсли;
	НоваяЗапись.Статус = Перечисления.mcp_СтатусыПроверкиКода.Ожидает;
	НаборЗаписей.Записать(Истина);
	
	Если Отладка Тогда
		
		mcp_ПроверкаКода.НачатьПроверкуКодов();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторЗадачи", ИдентификаторЗадачи);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	mcp_ОчередьПроверкиКода.Результат КАК Результат
		|ИЗ
		|	РегистрСведений.mcp_ОчередьПроверкиКода КАК mcp_ОчередьПроверкиКода
		|ГДЕ
		|	mcp_ОчередьПроверкиКода.УникальныйИдентификатор = &ИдентификаторЗадачи
		|	И mcp_ОчередьПроверкиКода.Статус = Значение(Перечисление.mcp_СтатусыПроверкиКода.Обработан)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		РезультатВыполнения = Выборка.Результат;

	Иначе		
		// 3. Цикл ожидания результата (polling)
		ТаймаутОжидания = 360; // секунд
		ШагОжидания = 2; // секунды
		ШагВМиллисекундах = ШагОжидания * 1000; 
		КоличествоПопыток = ТаймаутОжидания / ШагОжидания;
		
		РезультатВыполнения = Неопределено;
		ЗадачаОбработана = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторЗадачи", ИдентификаторЗадачи);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	mcp_ОчередьПроверкиКода.Результат КАК Результат
		|ИЗ
		|	РегистрСведений.mcp_ОчередьПроверкиКода КАК mcp_ОчередьПроверкиКода
		|ГДЕ
		|	mcp_ОчередьПроверкиКода.УникальныйИдентификатор = &ИдентификаторЗадачи
		|	И mcp_ОчередьПроверкиКода.Статус = Значение(Перечисление.mcp_СтатусыПроверкиКода.Обработан)";
		
		СчетчикПопыток = 0;
		Пока СчетчикПопыток < КоличествоПопыток Цикл
			
			ВызватьПаузу(ШагВМиллисекундах);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				РезультатВыполнения = Выборка.Результат;
				ЗадачаОбработана = Истина;
				Прервать;
			КонецЕсли;
			
			СчетчикПопыток = СчетчикПопыток + 1;
			
		КонецЦикла;
		
		// 4. Обработка результата сборки
		Если Не ЗадачаОбработана Тогда
			ВызватьИсключение "Таймаут ожидания сборки внешней обработки (" + ТаймаутОжидания + " сек).";
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыполнитьПростойСценарий(Код, Контекст)
	
	// 1. Анализ на количество процедур/функций и извлечение тела кода
	КодДляАнализа = Врег(Код);
	КоличествоПроцедур = СтрЧислоВхождений(КодДляАнализа, "КОНЕЦПРОЦЕДУРЫ");
	КоличествоФункций  = СтрЧислоВхождений(КодДляАнализа, "КОНЕЦФУНКЦИИ");
	
	Если КоличествоПроцедур + КоличествоФункций > 1 Тогда
		ВызватьИсключение "Простой режим выполнения кода поддерживает не более одной процедуры или функции.";
	КонецЕсли;
	
	// 2. Извлечение тела процедуры/функции, если она есть
	ТелоКода = Код;
	Если КоличествоПроцедур + КоличествоФункций = 1 Тогда
		
		ПозНачалоОпределения = ?(КоличествоПроцедур > 0, СтрНайти(КодДляАнализа, "ПРОЦЕДУРА "), СтрНайти(КодДляАнализа, "ФУНКЦИЯ "));
		ПозКонецСтрокиОпределения = СтрНайти(Код, Символы.ПС, , ПозНачалоОпределения);
		Если ПозКонецСтрокиОпределения = 0 Тогда
			ПозКонецСтрокиОпределения = СтрДлина(Код) + 1;
		КонецЕсли;
		
		ПозКонецПроцедуры = СтрНайти(КодДляАнализа, "КОНЕЦПРОЦЕДУРЫ");
		ПозКонецФункции   = СтрНайти(КодДляАнализа, "КОНЕЦФУНКЦИИ");
		ПозКонецОпределения = ?(ПозКонецПроцедуры > 0, ПозКонецПроцедуры, ПозКонецФункции);
		
		ТелоКода = Сред(Код, ПозКонецСтрокиОпределения + 1, ПозКонецОпределения - ПозКонецСтрокиОпределения - 1);
		
	КонецЕсли;
	
	// 3. Обработка оператора "Возврат"
	ИмяПеременнойРезультата = "__mcp_tool_execution_result";
	МодифицированноеТело = ТелоКода;
	ЕстьВозврат = Ложь;
	
	// Простой поиск для определения наличия возврата
	Если СтрНайти(Врег(ТелоКода), "ВОЗВРАТ;") = 0 И СтрНайти(Врег(ТелоКода), "ВОЗВРАТ") > 0 Тогда
		ЕстьВозврат = Истина;
		__mcp_tool_execution_result = Неопределено;
		// Используем цикл для регистронезависимой замены
		МодифицированноеТело = "";
		ИсходныеДанные = ТелоКода;
		Пока Истина Цикл
			Поз = СтрНайти(Врег(ИсходныеДанные), "ВОЗВРАТ");
			Если Поз = 0 Тогда
				МодифицированноеТело = МодифицированноеТело + ИсходныеДанные;
				Прервать;
			КонецЕсли;
			МодифицированноеТело = МодифицированноеТело + Лев(ИсходныеДанные, Поз - 1) + ИмяПеременнойРезультата + " =";
			ИсходныеДанные = Сред(ИсходныеДанные, Поз + 7); // Длина "Возврат"
		КонецЦикла;
	КонецЕсли;
	
	// 4. Формирование и выполнение итогового кода
	КодДляВыполнения = "";
	Для Каждого КлючИЗначение Из Контекст Цикл
		КодДляВыполнения = КодДляВыполнения + КлючИЗначение.Ключ 
			+ " = " + mcp_ОбщегоНазначения.ПредставлениеЗначенияДляКода(КлючИЗначение.Значение) + ";" + Символы.ПС;
	КонецЦикла;
	КодДляВыполнения = КодДляВыполнения + МодифицированноеТело;
	
	Выполнить(КодДляВыполнения);
	
	// 5. Возврат результата
	Если ЕстьВозврат Тогда
		РезультатВычисления = Вычислить(ИмяПеременнойРезультата);
		Если ТипЗнч(РезультатВычисления) = Тип("Строка") Тогда
			Возврат "Код выполнен успешно. Результат = " + РезультатВычисления;
		Иначе
			Возврат "Код выполнен успешно. Результат = " + Строка(РезультатВычисления);
		КонецЕсли;
	Иначе
		Возврат "Код выполнен успешно (без возвращаемого значения).";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
